{"basics":{"name":"Tao Guo","email":"cocotao.guo@connect.polyu.hk","research interest":"Edge Learning, Federated Learning, Trustworthy Machine Learning and Large Vision-Language Models"},"work":[],"volunteer":[],"education":[{"institution":"The Hong Kong Polytechnic University, Hong Kong","area":"Department of Computing","studyType":"Ph.D.","startDate":"2020","endDate":"current","score":"CGPA: 3.4/4"},{"institution":"Columbia University in the City of New York, New York, U.S.","area":"Statistics, Graduate School of Arts and Sciences","studyType":"M.S.","startDate":"2017","endDate":"2019","score":"CGPA: 3.5/4"},{"institution":"B.E. Huazhong University of Science and Technology, Wuhan, China","area":"Computer Science and Technology, School of Computer Science and Technology","studyType":"B.E.","startDate":"2013","endDate":"2017","score":"CGPA: 3.8/4"}],"publications":[{"name":"training with loss-aware compensation and backward quantization for tiny on-device learning","publisher":"Zhou, Qihua and Guo, Song and Qu, Zhihao and Guo, Jingcai and Xu, Zhenda and Zhang, Jiewei and Guo, Tao and Luo, Boyuan and Zhou, Jingren","summary":"2021 USENIX Annual Technical Conference (USENIX ATC 21)","releaseDate":"2021"},{"name":"Promptfl: Let federated participants cooperatively learn prompts instead of models-federated learning in age of foundation model","publisher":"Guo, Tao and Guo, Song and Wang, Junxiao and Tang, Xueyang and Xu, Wenchao","summary":"IEEE Transactions on Mobile Computing","releaseDate":"2023"},{"name":"Efficient Attribute Unlearning: Towards Selective Removal of Input Attributes from Feature Representations","publisher":"Guo, Tao and Guo, Song and Zhang, Jiewei and Xu, Wenchao and Wang, Junxiao","summary":"arXiv preprint arXiv:2202.13295","releaseDate":"2022"},{"name":"pFedPrompt: Learning Personalized Prompt for Vision-Language Models in Federated Learning","publisher":"Guo, Tao and Guo, Song and Wang, Junxiao","summary":"Proceedings of the ACM Web Conference 2023","releaseDate":"2023"},{"name":"Tree Learning: Towards Promoting Coordination in Scalable Multi-Client Training Acceleration","publisher":"Guo, Tao and Guo, Song and Wu, Feijie and Xu, Wenchao and Zhang, Jiewei and Zhou, Qihua and Chen, Quan and Zhuang, Weihua","summary":"IEEE Transactions on Mobile Computing","releaseDate":"2023"},{"name":"Hierarchical channel-spatial encoding for communication-efficient collaborative learning","publisher":"Zhou, Qihua and Guo, Song and Liu, Yi and Zhang, Jie and Zhang, Jiewei and Guo, Tao and Xu, Zhenda and Liu, Xun and Qu, Zhihao","summary":"Advances in Neural Information Processing Systems","releaseDate":"2022"},{"name":"","publisher":"","summary":"","releaseDate":""}],"awards":[{"title":"School of Computer Science People's Scholarship","date":"2015 - 2016","awarder":"Huazhong University of Science and Technology, Wuhan, China","summary":""},{"title":"School of Computer Science People's Scholarship","date":"2014 - 2015","awarder":"Huazhong University of Science and Technology, Wuhan, China","summary":""}],"certificates":[],"skills":[],"languages":[],"interests":[],"references":[],"projects":[]}